[
    {
        "version": "1.1.1",
        "time": 1647812079163,
        "changes": "Welcome to Metropolis mobile!\n\n\nThis is our first public release, so most of you are seeing this for the first time. If you'd like a brief introduction to the features in this app, head over to settings -> changelog and read my very cool intro!!!\n\nHere are some of the things we've updated since v1.0.0: \n- **You can toggle between light mode and dark mode now!** For those who wish to inflict maximum pain upon their eyeballs, now is the perfect opportunity. \n- **We made the map not fly around anymore.** No more road trips on the map, although if you flunked geography like I did you'd get lost anyway. \n- **We overhauled the colours on the app.** My autocorrect keeps trying to change it to \"color\". No chance Florida man. \n- **Timetable fixed!** We solved a bug where it showed you had no class when you forgot to put your timetable in. You *wish* you could go home. \n- **The load time for announcements has been significantly reduced.** I promise I wasn't mining bitcoin on your phone. \n- **Now you won't get logged out after a day.** No more entering passwords every day! (I still don't remember mine, any of you know it?)\n- **Hopefully we fixed the random crashes.** The code monkeys at our headquarters worked VEWY HAWD to fix this!\n- **You can now rotate your app on tablets.** I almost broke my neck fixing that one. \n- We also fixed a bunch of random irrelevant bugs that I don't care enough to include here because I think I'm funny. \n\nHere's what we're planning for the future: \n- **Notifications!!!!!** We can't spam you with Discord pings, but we'll try our best. \n- **Widgets** Oh boy who doesn't love a funky little blob on the home screen!\n- **Editable Calendar** We'll add the ability to add your homework due date. Whether your follow it or not is a different story. \n- **Teacher view** For teachers, you'll be able to approve or deny your club's announcements right from this app! Please don't email me with \"I forgot my password\". \n\n\nThat is all! If you read through all of this I love you very much. \n\nCheers!\n- Patrick, Project Metropolis"
    },
    {
        "version": "1.0.0",
        "time": 1643672157193,
        "changes": "Welcome to Metropolis!\n\nThis is the very first release for the Metropolis mobile app!\n\nHere are some of our core features to get you started: \n- **Home**: Access today's schedule and information! No more \"i forgor there's class today 💀\".\n- **Announcements**: Might be a good place to catch up on announcements from [our website](https://maclyonsden.com/announcements) because you've definitely paid attention to the morning announcements. \n- **Calendar**: Enjoy frequently checking for when the breaks start (hint: it's the week of March 14th)\n- **Map**: Woke up in the middle of nowhere? Good luck, we can't help you with that. What we can help you with, is getting to your classes! Now you know exactly where to go to suffer for another period. \n- **Settings**: Have a read through information about the app and the legal mumbo jumbo that you promise you won't just skip. Or read this again in the changelog, I won't mind ;)\n\nThanks for using our app! <3\n\\- Patrick, Project Metropolis"
    }
]